import { SlashCommandBuilder } from "discord.js";

export const command = new SlashCommandBuilder()
 .setName('旅行者')
 .setDescription('旅行者的素材')

export const action = async (ctx) =>{
    ctx.reply(`突破素材:風車菊、破損的面具(丘丘人)
風主:
天賦素材:自由、詩文、抗爭、繪卷(丘丘薩滿)、東風的吐息(風魔龍)
聖遺物:風套、宗室
聖遺物有效詞條:充能、精通
武器:蒼古、西福斯的月光、鐵蜂刺、紙傘
岩主:
天賦素材:自由、詩文、抗爭、繪卷(丘丘薩滿)、牢固的箭簇(丘丘弓手)、東風的吐息(風魔龍)、北風之尾(北風狼)
聖遺物:宗室、2磐岩2攻擊
聖遺物有效詞條:攻擊、充能、雙爆
武器:綠箭、霧切、天空、西風、祭禮、黎明神劍
雷主:
天賦素材:浮世、天光、風雅、刀鐔(野伏眾)、龍王之冕(若陀龍王)
聖遺物:流浪者(4星)、2絕緣+散套
聖遺物有效詞條:充能
武器:西風、祭禮、天空
草主:
天賦素材:巧思、諍言、篤行、蕈獸孢子、凶將之手眼(雷神)
聖遺物:宗室、草套
聖遺物有效詞條:攻擊、充能、雙爆
武器:蒼古、霧切、綠劍、原木刀、祭禮、西風`)
}